app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."section" = $1 GROUP BY "appointments"."time_slot", "appointments"."id"  [["section", "Mock_1"]]
---
  def index
    # Sort appointments by section, then by timeslot
    @appointments = Appointment.all.order(:section, :time_slot)

INSERT INTO "appointments" ("section", "time_slot", "company", "student", "UIN", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 1]]
---
  def destroy
    # Standard Rails behavior. Delete appointment with given id.
    @appointment.destroy

DELETE FROM "appointments"
---
  def generate
    @studentfinish = []
    @errormessage = ["Error timeslot Below:"]
    Appointment.delete_all