app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"  ORDER BY "companies"."name" ASC
---
  def index
    @companies = Company.all.order(:name)

INSERT INTO "companies" ("name", "contact_person", "contact_email", "sponsor_level", "citizenship", "job_type", "student_level", "rep_1", "rep_2", "rep_3", "rep_4", "rep_5", "rep_6", "intvw_1_rep_no", "intvw_2_rep_no", "clinic_1_rep_no", "clinic_2_rep_no", "clinic_3_rep_no", "lunch_rep_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @company = Company.new(company_params)
    eve_id = Event.where("for_company = true").pluck(:id)

    respond_to do |format|
      if @company.save

UPDATE "companies" SET "citizenship" = $1, "job_type" = $2, "intvw_2_rep_no" = $3, "updated_at" = $4 WHERE "companies"."id" = $5  [["citizenship", "US Citizen Only"], ["job_type", "Internship"], ["intvw_2_rep_no", 1], ["updated_at", "2015-04-29 19:43:56.904219"], ["id", 2]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 5]]
---
  def update
    respond_to do |format|
      if @company.update(company_params)
        eve_id = Event.where("for_company = true").pluck(:id)
        it = 0
        @company.companyevents.where(company_id: @company.id).each do |ce|
          ce.update(event_id: eve_id[it])
          it = it + 1
        end

        # This was one use of the previous broken mailer. Replace this with the new mailer, and remove this comment.
        # UserMailer.com_reg(@company).deliver_now

        format.html { redirect_to @company, notice: 'Company was successfully updated.' }
        format.json { render :show, status: :ok, location: @company }
      else
        @eves = Event.where("for_company = true").pluck(:id, :name, :event_date, :start_time, :end_time)
        @it = 0
        @new_flag = 0
        @reps = @company.companyevents.collect(&:representatives)

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 209]]
---
  def destroy
    @company.companyevents.destroy_all