app/controllers/sessions_controller.rb

SELECT  "useradds".* FROM "useradds" WHERE "useradds"."email" = $1 LIMIT 1  [["email", "sdddddas@tamu.edue"]]
---
  def create
    useradd = Useradd.find_by(email: params[:session][:email].downcase)