app/controllers/students_controller.rb

SELECT "students".* FROM "students"  ORDER BY "students"."UIN" ASC
SELECT "students".* FROM "students"
---
  def index
    @events = Event.where("for_student = true").pluck(:id,:name)
    $students = Student.all.order(:UIN)
    $students.each do |x|

SELECT "timeslots".* FROM "timeslots" WHERE (section = 'Mock Interview 1' AND stunum>0)
---
  def edit
    @logged_in = log_in?
    correct_hash = correct_hash(@student.edithash, params[:edithash])
    # Verify login
    if log_in? || cus_indentify(get_id) || correct_hash
      @event_details = Event.where("for_student = true").order(:event_date, :start_time, :name).pluck(:id, :name, :event_date, :start_time, :end_time, :editable)
      @events = Event.where("for_student = true").pluck(:id, :name)
      # Show Timeslots
      $selected_slots = []
      @student.timeslots.each do |x|

INSERT INTO "students" ("name", "UIN", "email", "US_Citizen", "degree", "position_type", "Mock_1", "Mock_2", "Resume_1", "Resume_2", "Resume_3", "Lunch", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
SELECT "timeslots".* FROM "timeslots" WHERE (section = 'Mock Interview 1' AND stunum>0)
---
  def create
    @student = Student.new(student_params)
    @event_details = Event.where("for_student = true").order(:event_date, :start_time, :name).pluck(:id, :name, :event_date, :start_time, :end_time, :editable)

    # Set edithash
    if @student.edithash == nil
      @student.edithash = SecureRandom.urlsafe_base64
    end

    @events = Event.where("for_student = true").pluck(:id, :name)
    @events.each do |id,name|
      $selected_slots[id] = params[name]
    end

    @event_slots = Hash.new([])
    respond_to do |format|
      # Try to save new information
      if @student.save
        input_session(@student.id)
	      Timeslot.decrease_1(@student.id)

      	@events = Event.where("for_student = true").pluck(:id,:name)
      	@events.each do |id,name|
          temp1, temp2 = set_menu(id)
      	  if(params[name] != "0"  && !params[name].nil? && !params[name].empty?)
      	    @student.timeslots << Timeslot.find(params[name])

SELECT "timeslots".* FROM "timeslots" WHERE (section = 'Mock Interview 1' AND stunum>0)
UPDATE "students" SET "Mock_1" = $1, "Mock_2" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["Mock_1", "10:20am-10:40am"], ["Mock_2", "10:40am-11:00am"], ["updated_at", "2015-04-27 04:05:16.766565"], ["id", 33]]
UPDATE "timeslots" SET "stunum" = $1, "updated_at" = $2 WHERE "timeslots"."id" = $3  [["stunum", 21], ["updated_at", "2015-04-26 00:58:35.676123"], ["id", 2]]
---
  def update
    respond_to do |format|
      @event_details = Event.where("for_student = true").order(:event_date, :start_time, :name).pluck(:id, :name, :event_date, :start_time, :end_time, :editable)
      @events = Event.where("for_student = true").pluck(:id, :name)
      @events.each do |id,name|
        $selected_slots[id] = params[name]
      end

      # When updating, temporarily release timeslots
    	Timeslot.increase_1(@student.id)
    	@student.timeslots = []
    	@events = Event.where("for_student = true").pluck(:name)
    	@events.each do |name|
      	if(params[name] != "0"  && !params[name].nil? && !params[name].empty?)
      	    @student.timeslots << Timeslot.find(params[name])
      	end
      end

      if @student.edithash == nil
        @student.edithash = SecureRandom.urlsafe_base64
      end

      # Ensure that the student was updated
      if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 1]]
---
  def destroy
    begin
      UserMailer.stu_del(@student).deliver_now
    rescue Net::SMTPAuthenticationError
      flash[:notice] = "SMTP server denied mail request."
    rescue StandardError
      flash[:warning] = "Unexpected Email Error. Please check the logs."
    end
    @student.destroy

SELECT "timeslots".* FROM "timeslots" WHERE (section = 'Mock Interview 1' AND stunum>0)
---
    def set_menu(arg)
      result_slots= Timeslot.where("event_id = ? AND stunum > 0", arg).collect{|item| [item.id, item.start_time, item.end_time, item.stunum]}