app/controllers/timeslots_controller.rb

  def index
    @timeslots = Timeslot.group('section','id')
---
SELECT "timeslots".* FROM "timeslots"  ORDER BY "timeslots"."section" ASC, "timeslots"."slot" ASC

  def create
    @timeslot = Timeslot.new(timeslot_params)

    respond_to do |format|
      if @timeslot.save
---
INSERT INTO "timeslots" ("att_date", "section", "slot", "stunum", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["att_date", "2015-07-01"], ["section", "Resume Clinic 1"], ["slot", "11:00am-11:20am"], ["stunum", 26], ["created_at", "2015-04-26 00:51:35.869873"], ["updated_at", "2015-04-26 00:51:35.869873"]]

  def update
    respond_to do |format|
      if @timeslot.update(timeslot_params)
---
UPDATE "timeslots" SET "att_date" = $1, "section" = $2, "slot" = $3, "stunum" = $4, "updated_at" = $5 WHERE "timeslots"."id" = $6  [["att_date", nil], ["section", nil], ["slot", nil], ["stunum", nil], ["updated_at", "2015-05-06 18:21:43.148468"], ["id", 18]]

  def destroy
    @timeslot.destroy
---
DELETE FROM "timeslots" WHERE "timeslots"."id" = $1  [["id", 2]]

    def set_timeslot
      @timeslot = Timeslot.find(params[:id])
---
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT 1  [["id", 2]]