app/controllers/useradds_controller.rb

  def show
    @useradd = Useradd.find(params[:id])
---
SELECT  "useradds".* FROM "useradds" WHERE "useradds"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @useradd = Useradd.new(user_params)
    if @useradd.save
---
INSERT INTO "useradds" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"